var sel2=[
["见习水手","初级水手","中级水手","高级水手","小力水手","大力水手","奥里芬儿","水手长","实习三副","三副","实习二副","二副","实习大副","大副","突尼斯海盗","加勒比海盗","船长","海盗船长","红胡子海盗","荣誉舰长","舰长助理","舰长","舰队副司","舰队司令","海军副司","海军司令","论坛认证用户"],
["海军少尉","海军中尉","海军上尉","海军少校","海军中校","海军上校","海军少将","海军中将","海军上将","海军大将"],
["海军副司令"],
["海军司令"],
["海军司令"],
];
var sel2_value=[
["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27"],
["1","2","3","4","5","6","7","8","9","10"],
["1"],
["1"],
["1"],
];
function getSel2(){
var slt1=document.form1.groupTypeId;//数组获得一级下拉框对象
var slt2=document.form1.groupId;//数组获得二级下拉框对象
var slt12=sel2[slt1.selectedIndex-1];//得到对应select1的select2的内容
var sltl2_value=sel2_value[slt1.selectedIndex-1];//得到对应select1的select2的值
slt2.length=1;//清空select下拉框
//**将数组中的值填充到下拉框中**/
if((slt1.selectedIndex-1)>=0){
         for(var i=0;
         i<slt12.length;i++){slt2[i+1]=new Option(slt12[i],sltl2_value[i]);
         }
}
}